scripts/stress/artillery-production.yml
config:
  target: "https://deurden-bocht-rally-web.vercel.app"
  phases:
    - duration: 120
      arrivalRate: 5
      rampTo: 10
      name: "warmup"
    - duration: 180
      arrivalRate: 10
      name: "steady"
  maxVusers: 50
  defaults:
    headers:
      User-Agent: "artillery"
  http:
    timeout: 30

scenarios:
  - name: "public-pages"
    flow:
      - get:
          url: "/"
      - get:
          url: "/about"
      - get:
          url: "/registration"
      - get:
          url: "/terms"
      - get:
          url: "/site-access"

  - name: "auth-pages"
    flow:
      # Step 1: Get site-access page
      - get:
          url: "/site-access"
      
      # Step 2: Submit site-access password (no CSRF needed)
      - post:
          url: "/site-access"
          followRedirect: true
          form:
            password: "DdB2026!"
      
      # Step 3: Get login page and capture CSRF token
      - get:
          url: "/login"
          capture:
            - regex: "name=\"__csrf\" value=\"([^\"]+)\""
              as: "loginCsrf"
      
      # Step 4: Submit login form
      - post:
          url: "/login"
          followRedirect: true
          form:
            email: "{{ $processEnvironment.ADMIN_EMAIL }}"
            password: "{{ $processEnvironment.ADMIN_PASSWORD }}"
            __csrf: "{{ loginCsrf }}"
      - get:
          url: "/dashboard"
      - get:
          url: "/rally"
      - get:
          url: "/live-map"
      - get:
          url: "/event-albums"
      - get:
          url: "/gallery"
      - get:
          url: "/zone/1"